## Шаблон кода на C++

Типичный шаблон кода C++ выглядит следующим образом:

```cpp
#include <bits/stdc++.h>
using namespace std;
int main(){
  // код программы здесь
 }
```

Строка `#include` в начале кода является функцией компилятора C++, что позволяет нам подключить 
всю стандартную библиотеку. Таким образом, нет необходимости отдельно включать библиотеки, такие 
как `iostream`, `vector` и `algorithm`.

Строка `using` объявляет, что классы и функции стандартной библиотеки могут быть использованы 
непосредственно в коде. Без использования строки нам пришлось бы писать, например, `std::cout`, 
но теперь достаточно написать `cout`.
